[NoCoverage] BlockStatement
src/Components/select.tsx:16:73
 
 export default function Select({ name, options, defaultVal }: Props) {
   const [selected, setSelected] = useState(defaultVal)
-  const handleChange = (event: React.ChangeEvent<HTMLSelectElement>) => {
-    setSelected(event.target.value)
-  }
+  const handleChange = (event: React.ChangeEvent<HTMLSelectElement>) => {}
   return (
     <select

[Killed] ArrowFunction
src/Components/select.tsx:26:20
       onChange={handleChange}
     >
-      {options.map((option) => (
-        <option key={option.value} value={option.value}>
-          {option.label}
-        </option>
-      ))}
+      {options.map(() => undefined)}
     </select>
   )
killedBy: SelectBoxのテスト defaultValueが正しく設定されていることを確認する
statusReason: Cannot read properties of undefined (reading 'value')
