[NoCoverage] BlockStatement
src/pages/_app.tsx:4:65
 import '@/styles/globals.css'
 import type { AppProps } from 'next/app'
 
-export default function App({ Component, pageProps }: AppProps) {
-  return <Component {...pageProps} />
-}
+export default function App({ Component, pageProps }: AppProps) {}
 
