[NoCoverage] ObjectLiteral
src/pages/api/githubApi.ts:22:29
 }
 
 // Octokit
-const octokit = new Octokit({ auth: process.env.GITHUB_TOKEN })
+const octokit = new Octokit({})
 
 // GitHubのリポジトリを取得する

[NoCoverage] BlockStatement
src/pages/api/githubApi.ts:30:7
 ): Promise<{
   totalCount: number
   repositories: GitHubRepository[]
-}> => {
-  const response = await octokit.rest.search.repos({
-    q: `stars:>100+good-first-issues:>1+language:${searchCondition.language}`,
-    sort: searchCondition.sort,
-    order: 'desc',
-    per_page: searchCondition.perPage,
-    page: searchCondition.page,
-  })
-  if (response.data.items) {
-    const repositories: GitHubRepository[] = response.data.items.map((item) => {
-      return {
-        id: item.id,
-        htmlUrl: item.html_url,
-        repositoryName: item.name,
-        avatorUrl: item.owner?.avatar_url ?? '',
-        description: item.description ?? '',
-        stargazersCount: item.stargazers_count,
-        watchersCount: item.watchers_count,
-        forksCount: item.forks_count,
-      }
-    })
-    return { totalCount: response.data.total_count, repositories }
-  }
-  return { totalCount: 0, repositories: [] }
-}
+}> => {}
 

[NoCoverage] StringLiteral
src/pages/api/githubApi.ts:32:8
   repositories: GitHubRepository[]
 }> => {
   const response = await octokit.rest.search.repos({
-    q: `stars:>100+good-first-issues:>1+language:${searchCondition.language}`,
+    q: ``,
     sort: searchCondition.sort,
     order: 'desc',

[NoCoverage] ConditionalExpression
src/pages/api/githubApi.ts:38:7
     per_page: searchCondition.perPage,
     page: searchCondition.page,
   })
-  if (response.data.items) {
+  if (true) {
     const repositories: GitHubRepository[] = response.data.items.map((item) => {
       return {

[NoCoverage] ConditionalExpression
src/pages/api/githubApi.ts:38:7
     per_page: searchCondition.perPage,
     page: searchCondition.page,
   })
-  if (response.data.items) {
+  if (false) {
     const repositories: GitHubRepository[] = response.data.items.map((item) => {
       return {

[NoCoverage] BlockStatement
src/pages/api/githubApi.ts:39:80
     page: searchCondition.page,
   })
   if (response.data.items) {
-    const repositories: GitHubRepository[] = response.data.items.map((item) => {
-      return {
-        id: item.id,
-        htmlUrl: item.html_url,
-        repositoryName: item.name,
-        avatorUrl: item.owner?.avatar_url ?? '',
-        description: item.description ?? '',
-        stargazersCount: item.stargazers_count,
-        watchersCount: item.watchers_count,
-        forksCount: item.forks_count,
-      }
-    })
+    const repositories: GitHubRepository[] = response.data.items.map((item) => {})
     return { totalCount: response.data.total_count, repositories }
   }

[NoCoverage] ObjectLiteral
src/pages/api/githubApi.ts:40:14
   })
   if (response.data.items) {
     const repositories: GitHubRepository[] = response.data.items.map((item) => {
-      return {
-        id: item.id,
-        htmlUrl: item.html_url,
-        repositoryName: item.name,
-        avatorUrl: item.owner?.avatar_url ?? '',
-        description: item.description ?? '',
-        stargazersCount: item.stargazers_count,
-        watchersCount: item.watchers_count,
-        forksCount: item.forks_count,
-      }
+      return {}
     })
     return { totalCount: response.data.total_count, repositories }

[NoCoverage] LogicalOperator
src/pages/api/githubApi.ts:44:20
         id: item.id,
         htmlUrl: item.html_url,
         repositoryName: item.name,
-        avatorUrl: item.owner?.avatar_url ?? '',
+        avatorUrl: item.owner?.avatar_url && '',
         description: item.description ?? '',
         stargazersCount: item.stargazers_count,

[NoCoverage] OptionalChaining
src/pages/api/githubApi.ts:44:20
         id: item.id,
         htmlUrl: item.html_url,
         repositoryName: item.name,
-        avatorUrl: item.owner?.avatar_url ?? '',
+        avatorUrl: item.owner.avatar_url ?? '',
         description: item.description ?? '',
         stargazersCount: item.stargazers_count,

[NoCoverage] LogicalOperator
src/pages/api/githubApi.ts:45:22
         htmlUrl: item.html_url,
         repositoryName: item.name,
         avatorUrl: item.owner?.avatar_url ?? '',
-        description: item.description ?? '',
+        description: item.description && '',
         stargazersCount: item.stargazers_count,
         watchersCount: item.watchers_count,
