[NoCoverage] BlockStatement
src/pages/index.tsx:22:98
   perPage: number
 }
 
-export default function Home({ repositories, language, sort, page, totalCount, perPage }: Props) {
-  return (
-    <>
-      <HeadComp />
-      <Header />
-      <main>
-        <div className='flex justify-end mr-8'>
-          <RepositorySearchForm language={language} sort={sort} />
-        </div>
-        <div className='flex flex-wrap p-4 justify-center'>
-          {repositories.length > 0 ? (
-            repositories.map((repository) => (
-              <RepositoryCard key={repository.id} repository={repository} />
-            ))
-          ) : (
-            <h1>NO Data or API Error. Please wait </h1>
-          )}
-        </div>
-        <Pagination currentPage={page} totalCount={totalCount} perPage={perPage} />
-      </main>
-    </>
-  )
-}
+export default function Home({ repositories, language, sort, page, totalCount, perPage }: Props) {}
 
 export const getServerSideProps: GetServerSideProps = async (context) => {

[NoCoverage] EqualityOperator
src/pages/index.tsx:32:12
           <RepositorySearchForm language={language} sort={sort} />
         </div>
         <div className='flex flex-wrap p-4 justify-center'>
-          {repositories.length > 0 ? (
+          {repositories.length >= 0 ? (
             repositories.map((repository) => (
               <RepositoryCard key={repository.id} repository={repository} />

[NoCoverage] ConditionalExpression
src/pages/index.tsx:32:12
           <RepositorySearchForm language={language} sort={sort} />
         </div>
         <div className='flex flex-wrap p-4 justify-center'>
-          {repositories.length > 0 ? (
+          {false ? (
             repositories.map((repository) => (
               <RepositoryCard key={repository.id} repository={repository} />

[NoCoverage] ArrowFunction
src/pages/index.tsx:33:30
         </div>
         <div className='flex flex-wrap p-4 justify-center'>
           {repositories.length > 0 ? (
-            repositories.map((repository) => (
-              <RepositoryCard key={repository.id} repository={repository} />
-            ))
+            repositories.map(() => undefined)
           ) : (
             <h1>NO Data or API Error. Please wait </h1>

[NoCoverage] StringLiteral
src/pages/index.tsx:54:35
     perPage: 50
   }
   let language = 'javascript'
-  let sort: SortOption['value'] = 'stars'
+  let sort: SortOption['value'] = ""
   let page = 1
   let perPage = 50

[NoCoverage] EqualityOperator
src/pages/index.tsx:57:7
   let sort: SortOption['value'] = 'stars'
   let page = 1
   let perPage = 50
-  if (Object.keys(context.query).length > 0) {
+  if (Object.keys(context.query).length <= 0) {
     if (context.query.language !== '' && typeof context.query.language == 'string') {
       searchCondition.language = context.query.language

[NoCoverage] ConditionalExpression
src/pages/index.tsx:57:7
   let sort: SortOption['value'] = 'stars'
   let page = 1
   let perPage = 50
-  if (Object.keys(context.query).length > 0) {
+  if (true) {
     if (context.query.language !== '' && typeof context.query.language == 'string') {
       searchCondition.language = context.query.language

[NoCoverage] EqualityOperator
src/pages/index.tsx:58:42
   let page = 1
   let perPage = 50
   if (Object.keys(context.query).length > 0) {
-    if (context.query.language !== '' && typeof context.query.language == 'string') {
+    if (context.query.language !== '' && typeof context.query.language != 'string') {
       searchCondition.language = context.query.language
       language =

[NoCoverage] ConditionalExpression
src/pages/index.tsx:58:9
   let page = 1
   let perPage = 50
   if (Object.keys(context.query).length > 0) {
-    if (context.query.language !== '' && typeof context.query.language == 'string') {
+    if (true) {
       searchCondition.language = context.query.language
       language =

[NoCoverage] ConditionalExpression
src/pages/index.tsx:61:43
     if (context.query.language !== '' && typeof context.query.language == 'string') {
       searchCondition.language = context.query.language
       language =
-        languageOprionts.find((option) => option.value === context.query.language)?.value ??
+        languageOprionts.find((option) => false)?.value ??
         'javascript'
     }

[NoCoverage] EqualityOperator
src/pages/index.tsx:61:43
     if (context.query.language !== '' && typeof context.query.language == 'string') {
       searchCondition.language = context.query.language
       language =
-        languageOprionts.find((option) => option.value === context.query.language)?.value ??
+        languageOprionts.find((option) => option.value !== context.query.language)?.value ??
         'javascript'
     }

[NoCoverage] ConditionalExpression
src/pages/index.tsx:64:9
         languageOprionts.find((option) => option.value === context.query.language)?.value ??
         'javascript'
     }
-    if (context.query.sort !== '' && typeof context.query.sort == 'string') {
+    if (true) {
       sort = sortOptions.find((option) => option.value === context.query.sort)?.value ?? 'stars'
       searchCondition.sort = sort

[NoCoverage] ConditionalExpression
src/pages/index.tsx:64:9
         languageOprionts.find((option) => option.value === context.query.language)?.value ??
         'javascript'
     }
-    if (context.query.sort !== '' && typeof context.query.sort == 'string') {
+    if (true && typeof context.query.sort == 'string') {
       sort = sortOptions.find((option) => option.value === context.query.sort)?.value ?? 'stars'
       searchCondition.sort = sort

[NoCoverage] OptionalChaining
src/pages/index.tsx:65:14
         'javascript'
     }
     if (context.query.sort !== '' && typeof context.query.sort == 'string') {
-      sort = sortOptions.find((option) => option.value === context.query.sort)?.value ?? 'stars'
+      sort = sortOptions.find(option => option.value === context.query.sort).value ?? 'stars'
       searchCondition.sort = sort
     }

[NoCoverage] ConditionalExpression
src/pages/index.tsx:65:43
         'javascript'
     }
     if (context.query.sort !== '' && typeof context.query.sort == 'string') {
-      sort = sortOptions.find((option) => option.value === context.query.sort)?.value ?? 'stars'
+      sort = sortOptions.find((option) => true)?.value ?? 'stars'
       searchCondition.sort = sort
     }

[NoCoverage] ConditionalExpression
src/pages/index.tsx:68:9
       sort = sortOptions.find((option) => option.value === context.query.sort)?.value ?? 'stars'
       searchCondition.sort = sort
     }
-    if (context.query.page !== '' && typeof context.query.page == 'string') {
+    if (true) {
       page = Number(context.query.page)
       if (isNaN(page)) {

[NoCoverage] ConditionalExpression
src/pages/index.tsx:68:9
       sort = sortOptions.find((option) => option.value === context.query.sort)?.value ?? 'stars'
       searchCondition.sort = sort
     }
-    if (context.query.page !== '' && typeof context.query.page == 'string') {
+    if (true && typeof context.query.page == 'string') {
       page = Number(context.query.page)
       if (isNaN(page)) {

[NoCoverage] BlockStatement
src/pages/index.tsx:70:24
     }
     if (context.query.page !== '' && typeof context.query.page == 'string') {
       page = Number(context.query.page)
-      if (isNaN(page)) {
-        page = 1
-      }
+      if (isNaN(page)) {}
       searchCondition.page = page
     }

[NoCoverage] ConditionalExpression
src/pages/index.tsx:70:11
     }
     if (context.query.page !== '' && typeof context.query.page == 'string') {
       page = Number(context.query.page)
-      if (isNaN(page)) {
+      if (false) {
         page = 1
       }

[NoCoverage] ConditionalExpression
src/pages/index.tsx:75:8
       }
       searchCondition.page = page
     }
-    if(context.query.per_page !== '' && typeof context.query.per_page == 'string') {
+    if(false) {
       perPage = Number(context.query.per_page)
       if (isNaN(perPage)) {

[NoCoverage] LogicalOperator
src/pages/index.tsx:75:8
       }
       searchCondition.page = page
     }
-    if(context.query.per_page !== '' && typeof context.query.per_page == 'string') {
+    if(context.query.per_page !== '' || typeof context.query.per_page == 'string') {
       perPage = Number(context.query.per_page)
       if (isNaN(perPage)) {

[NoCoverage] BlockStatement
src/pages/index.tsx:77:27
     }
     if(context.query.per_page !== '' && typeof context.query.per_page == 'string') {
       perPage = Number(context.query.per_page)
-      if (isNaN(perPage)) {
-        perPage = 50
-      }
+      if (isNaN(perPage)) {}
       searchCondition.perPage = perPage
     }

[NoCoverage] ConditionalExpression
src/pages/index.tsx:77:11
     }
     if(context.query.per_page !== '' && typeof context.query.per_page == 'string') {
       perPage = Number(context.query.per_page)
-      if (isNaN(perPage)) {
+      if (true) {
         perPage = 50
       }
