[Killed] BlockStatement
src/Components/pagination.tsx:17:89
  * @param {number} totalPage - 総ページ数です。
  * @returns {Array<string | number>} - 表示するページ番号の配列です。
  */
-function getPageNumbers(currentPage: number, totalPage: number): Array<string | number> {
-  const pagesArray: Array<string | number> = []
-
-  const startPage =
-    currentPage >= totalPage - 1 ? Math.max(totalPage - 4, 1) : Math.max(currentPage - 2, 1)
-  const endPage = currentPage <= 2 ? Math.min(5, totalPage) : Math.min(currentPage + 2, totalPage)
-
-  for (let i = startPage; i <= endPage; i++) {
-    pagesArray.push(i)
-  }
-
-  if (startPage >= 2) {
-    if (totalPage > 6) pagesArray.unshift('...')
-    pagesArray.unshift(1)
-  }
-  if (endPage <= totalPage - 1) {
-    if (totalPage > 6) pagesArray.push('...')
-    pagesArray.push(totalPage)
-  }
-
-  return pagesArray
-}
+function getPageNumbers(currentPage: number, totalPage: number): Array<string | number> {}
 
 export default function Pagination({ currentPage, totalCount, perPage }: Props) {
killedBy: Paginationのテスト Paginationのページ数が6以下の場合にlinkの数がページと同じように表示されているかどうか
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrayDeclaration
src/Components/pagination.tsx:18:46
  * @returns {Array<string | number>} - 表示するページ番号の配列です。
  */
 function getPageNumbers(currentPage: number, totalPage: number): Array<string | number> {
-  const pagesArray: Array<string | number> = []
+  const pagesArray: Array<string | number> = ["Stryker was here"]
 
   const startPage =
killedBy: Paginationのテスト Paginationのページ数が6以下の場合にlinkの数がページと同じように表示されているかどうか
statusReason: expected [ <a …(2)></a>, <a …(2)></a>, …(1) ] to have a length of 2 but got 3

[Killed] MethodExpression
src/Components/pagination.tsx:21:65
   const pagesArray: Array<string | number> = []
 
   const startPage =
-    currentPage >= totalPage - 1 ? Math.max(totalPage - 4, 1) : Math.max(currentPage - 2, 1)
+    currentPage >= totalPage - 1 ? Math.max(totalPage - 4, 1) : Math.min(currentPage - 2, 1)
   const endPage = currentPage <= 2 ? Math.min(5, totalPage) : Math.min(currentPage + 2, totalPage)
 
killedBy: Paginationのテスト Paginationのページ数が7以上の場合にlinkの数が5つ表示されているかどうか
statusReason: expected [ <a …(2)></a>, <a …(2)></a>, …(6) ] to have a length of 6 but got 8

[Killed] ArithmeticOperator
src/Components/pagination.tsx:21:74
   const pagesArray: Array<string | number> = []
 
   const startPage =
-    currentPage >= totalPage - 1 ? Math.max(totalPage - 4, 1) : Math.max(currentPage - 2, 1)
+    currentPage >= totalPage - 1 ? Math.max(totalPage - 4, 1) : Math.max(currentPage + 2, 1)
   const endPage = currentPage <= 2 ? Math.min(5, totalPage) : Math.min(currentPage + 2, totalPage)
 
killedBy: Paginationのテスト Paginationのページ数が7以上の場合に「...」が表示されているかどうか
statusReason: Found multiple elements with the text: ...

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  class="w-10 h-10 rounded-full inline-flex items-center text-lg justify-center"
>

[Killed] EqualityOperator
src/Components/pagination.tsx:22:19
 
   const startPage =
     currentPage >= totalPage - 1 ? Math.max(totalPage - 4, 1) : Math.max(currentPage - 2, 1)
-  const endPage = currentPage <= 2 ? Math.min(5, totalPage) : Math.min(currentPage + 2, totalPage)
+  const endPage = currentPage > 2 ? Math.min(5, totalPage) : Math.min(currentPage + 2, totalPage)
 
   for (let i = startPage; i <= endPage; i++) {
killedBy: Paginationのテスト Paginationのページ数が7以上の場合にlinkの数が5つ表示されているかどうか
statusReason: expected [ <a …(2)></a>, <a …(2)></a>, …(2) ] to have a length of 6 but got 4

[Killed] MethodExpression
src/Components/pagination.tsx:22:63
 
   const startPage =
     currentPage >= totalPage - 1 ? Math.max(totalPage - 4, 1) : Math.max(currentPage - 2, 1)
-  const endPage = currentPage <= 2 ? Math.min(5, totalPage) : Math.min(currentPage + 2, totalPage)
+  const endPage = currentPage <= 2 ? Math.min(5, totalPage) : Math.max(currentPage + 2, totalPage)
 
   for (let i = startPage; i <= endPage; i++) {
killedBy: Paginationのテスト Paginationのページ数が7以上の場合かつ現在ページが4のときに左右に「...」が表示されているかどうか
statusReason: expected '6' to be '...' // Object.is equality

[Killed] EqualityOperator
src/Components/pagination.tsx:24:27
     currentPage >= totalPage - 1 ? Math.max(totalPage - 4, 1) : Math.max(currentPage - 2, 1)
   const endPage = currentPage <= 2 ? Math.min(5, totalPage) : Math.min(currentPage + 2, totalPage)
 
-  for (let i = startPage; i <= endPage; i++) {
+  for (let i = startPage; i > endPage; i++) {
     pagesArray.push(i)
   }
killedBy: Paginationのテスト Paginationのページ数が6以下の場合にlinkの数がページと同じように表示されているかどうか
statusReason: Unable to find an accessible element with the role "link"

Here are the accessible roles:

  navigation:

  Name "Pagination":
  <nav

[Killed] BlockStatement
src/Components/pagination.tsx:24:46
     currentPage >= totalPage - 1 ? Math.max(totalPage - 4, 1) : Math.max(currentPage - 2, 1)
   const endPage = currentPage <= 2 ? Math.min(5, totalPage) : Math.min(currentPage + 2, totalPage)
 
-  for (let i = startPage; i <= endPage; i++) {
-    pagesArray.push(i)
-  }
+  for (let i = startPage; i <= endPage; i++) {}
 
   if (startPage >= 2) {
killedBy: Paginationのテスト Paginationのページ数が6以下の場合にlinkの数がページと同じように表示されているかどうか
statusReason: Unable to find an accessible element with the role "link"

Here are the accessible roles:

  navigation:

  Name "Pagination":
  <nav

[Killed] EqualityOperator
src/Components/pagination.tsx:28:7
     pagesArray.push(i)
   }
 
-  if (startPage >= 2) {
+  if (startPage < 2) {
     if (totalPage > 6) pagesArray.unshift('...')
     pagesArray.unshift(1)
killedBy: Paginationのテスト Paginationのページ数が6以下の場合にlinkの数がページと同じように表示されているかどうか
statusReason: expected [ <a …(2)></a>, <a …(2)></a>, …(1) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/Components/pagination.tsx:28:7
     pagesArray.push(i)
   }
 
-  if (startPage >= 2) {
+  if (false) {
     if (totalPage > 6) pagesArray.unshift('...')
     pagesArray.unshift(1)
killedBy: Paginationのテスト Does the link to the first page show up when there is 7 pages or more?
statusReason: expected '3' to be '1' // Object.is equality

[Killed] EqualityOperator
src/Components/pagination.tsx:29:9
   }
 
   if (startPage >= 2) {
-    if (totalPage > 6) pagesArray.unshift('...')
+    if (totalPage <= 6) pagesArray.unshift('...')
     pagesArray.unshift(1)
   }
killedBy: Paginationのテスト Paginationのページ数が7以上の場合かつ現在ページが4のときに左右に「...」が表示されているかどうか
statusReason: expected '2' to be '...' // Object.is equality

[Killed] ConditionalExpression
src/Components/pagination.tsx:29:9
   }
 
   if (startPage >= 2) {
-    if (totalPage > 6) pagesArray.unshift('...')
+    if (false) pagesArray.unshift('...')
     pagesArray.unshift(1)
   }
killedBy: Paginationのテスト Paginationのページ数が7以上の場合かつ現在ページが4のときに左右に「...」が表示されているかどうか
statusReason: expected '2' to be '...' // Object.is equality

[Killed] BlockStatement
src/Components/pagination.tsx:32:33
     if (totalPage > 6) pagesArray.unshift('...')
     pagesArray.unshift(1)
   }
-  if (endPage <= totalPage - 1) {
-    if (totalPage > 6) pagesArray.push('...')
-    pagesArray.push(totalPage)
-  }
+  if (endPage <= totalPage - 1) {}
 
   return pagesArray
killedBy: Paginationのテスト Paginationのページ数が7以上の場合に「...」が表示されているかどうか
statusReason: Unable to find an element with the text: .... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center bg-white px-4 py-3 sm:px-6"
    >

[Killed] ConditionalExpression
src/Components/pagination.tsx:32:7
     if (totalPage > 6) pagesArray.unshift('...')
     pagesArray.unshift(1)
   }
-  if (endPage <= totalPage - 1) {
+  if (false) {
     if (totalPage > 6) pagesArray.push('...')
     pagesArray.push(totalPage)
killedBy: Paginationのテスト Paginationのページ数が7以上の場合に「...」が表示されているかどうか
statusReason: Unable to find an element with the text: .... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center bg-white px-4 py-3 sm:px-6"
    >

[Killed] ConditionalExpression
src/Components/pagination.tsx:33:9
     pagesArray.unshift(1)
   }
   if (endPage <= totalPage - 1) {
-    if (totalPage > 6) pagesArray.push('...')
+    if (false) pagesArray.push('...')
     pagesArray.push(totalPage)
   }
killedBy: Paginationのテスト Paginationのページ数が7以上の場合に「...」が表示されているかどうか
statusReason: Unable to find an element with the text: .... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center bg-white px-4 py-3 sm:px-6"
    >

[Killed] EqualityOperator
src/Components/pagination.tsx:33:9
     pagesArray.unshift(1)
   }
   if (endPage <= totalPage - 1) {
-    if (totalPage > 6) pagesArray.push('...')
+    if (totalPage <= 6) pagesArray.push('...')
     pagesArray.push(totalPage)
   }
killedBy: Paginationのテスト Paginationのページ数が7以上の場合に「...」が表示されているかどうか
statusReason: Unable to find an element with the text: .... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center bg-white px-4 py-3 sm:px-6"
    >

[Killed] ArithmeticOperator
src/Components/pagination.tsx:42:29
 
 export default function Pagination({ currentPage, totalCount, perPage }: Props) {
   const router = useRouter()
-  let totalPage = Math.ceil(totalCount / perPage)
+  let totalPage = Math.ceil(totalCount * perPage)
   const apiMaxCount = 1000
   if (totalCount > apiMaxCount) {
killedBy: Paginationのテスト Paginationのページ数が6以下の場合にlinkの数がページと同じように表示されているかどうか
statusReason: expected [ <a …(2)></a>, <a …(2)></a>, …(4) ] to have a length of 2 but got 6

[Killed] BlockStatement
src/Components/pagination.tsx:44:33
   const router = useRouter()
   let totalPage = Math.ceil(totalCount / perPage)
   const apiMaxCount = 1000
-  if (totalCount > apiMaxCount) {
-    totalPage = Math.floor(apiMaxCount / perPage)
-  }
+  if (totalCount > apiMaxCount) {}
   let pageNumbers: Array<string | number> = getPageNumbers(currentPage, totalPage)
   return (
killedBy: Paginationのテスト PaginationのtotalCountが1000を超える場合は1000を超えるアイテムが表示されるページへの遷移をしないようにする
statusReason: expected '40' to be '20' // Object.is equality

[Killed] EqualityOperator
src/Components/pagination.tsx:44:7
   const router = useRouter()
   let totalPage = Math.ceil(totalCount / perPage)
   const apiMaxCount = 1000
-  if (totalCount > apiMaxCount) {
+  if (totalCount <= apiMaxCount) {
     totalPage = Math.floor(apiMaxCount / perPage)
   }
killedBy: Paginationのテスト Paginationのページ数が6以下の場合にlinkの数がページと同じように表示されているかどうか
statusReason: expected [ <a …(2)></a>, <a …(2)></a>, …(4) ] to have a length of 2 but got 6

[Killed] ArithmeticOperator
src/Components/pagination.tsx:45:28
   let totalPage = Math.ceil(totalCount / perPage)
   const apiMaxCount = 1000
   if (totalCount > apiMaxCount) {
-    totalPage = Math.floor(apiMaxCount / perPage)
+    totalPage = Math.floor(apiMaxCount * perPage)
   }
   let pageNumbers: Array<string | number> = getPageNumbers(currentPage, totalPage)
killedBy: Paginationのテスト PaginationのtotalCountが1000を超える場合は1000を超えるアイテムが表示されるページへの遷移をしないようにする
statusReason: expected '50000' to be '20' // Object.is equality

[Killed] BlockStatement
src/Components/pagination.tsx:51:45
   return (
     <div className='flex items-center justify-center bg-white px-4 py-3 sm:px-6'>
       <nav className='inline-flex gap-x-1.5' aria-label='Pagination'>
-        {pageNumbers.map((pageNumber, i) => {
-          if (pageNumber === '...') {
-            return (
-              <span
-                key={i}
-                className='w-10 h-10 rounded-full inline-flex items-center text-lg justify-center'
-              >
-                ...
-              </span>
-            )
-          }
-          return (
-            <Link
-              key={i}
-              href={{ pathname: router.pathname, query: { ...router.query, page: pageNumber } }}
-              className={`w-10 h-10 rounded-full inline-flex items-center justify-center text-sm ${
-                pageNumber === currentPage
-                  ? 'bg-indigo-600 font-semibold text-white'
-                  : 'ring-1 ring-inset ring-gray-300'
-              }`}
-            >
-              {pageNumber}
-            </Link>
-          )
-        })}
+        {pageNumbers.map((pageNumber, i) => {})}
       </nav>
     </div>
killedBy: Paginationのテスト Paginationのページ数が6以下の場合にlinkの数がページと同じように表示されているかどうか
statusReason: Unable to find an accessible element with the role "link"

Here are the accessible roles:

  navigation:

  Name "Pagination":
  <nav

[Killed] BlockStatement
src/Components/pagination.tsx:52:37
     <div className='flex items-center justify-center bg-white px-4 py-3 sm:px-6'>
       <nav className='inline-flex gap-x-1.5' aria-label='Pagination'>
         {pageNumbers.map((pageNumber, i) => {
-          if (pageNumber === '...') {
-            return (
-              <span
-                key={i}
-                className='w-10 h-10 rounded-full inline-flex items-center text-lg justify-center'
-              >
-                ...
-              </span>
-            )
-          }
+          if (pageNumber === '...') {}
           return (
             <Link
killedBy: Paginationのテスト Paginationのページ数が7以上の場合にlinkの数が5つ表示されているかどうか
statusReason: expected [ <a …(2)></a>, <a …(2)></a>, …(5) ] to have a length of 6 but got 7

[Killed] ConditionalExpression
src/Components/pagination.tsx:52:15
     <div className='flex items-center justify-center bg-white px-4 py-3 sm:px-6'>
       <nav className='inline-flex gap-x-1.5' aria-label='Pagination'>
         {pageNumbers.map((pageNumber, i) => {
-          if (pageNumber === '...') {
+          if (true) {
             return (
               <span
killedBy: Paginationのテスト Paginationのページ数が6以下の場合にlinkの数がページと同じように表示されているかどうか
statusReason: Unable to find an accessible element with the role "link"

Here are the accessible roles:

  navigation:

  Name "Pagination":
  <nav

[Killed] ConditionalExpression
src/Components/pagination.tsx:67:17
               key={i}
               href={{ pathname: router.pathname, query: { ...router.query, page: pageNumber } }}
               className={`w-10 h-10 rounded-full inline-flex items-center justify-center text-sm ${
-                pageNumber === currentPage
+                false
                   ? 'bg-indigo-600 font-semibold text-white'
                   : 'ring-1 ring-inset ring-gray-300'
killedBy: Paginationのテスト Paginationの現在のページのボタンがアクティブ表記されているか
statusReason: expect(element).toHaveClass("bg-indigo-600")

Expected the element to have class:
  bg-indigo-600
Received:
  w-10 h-10 rounded-full inline-flex items-center justify-center text-sm ring-1 ring-inset ring-gray-300

[Killed] EqualityOperator
src/Components/pagination.tsx:67:17
               key={i}
               href={{ pathname: router.pathname, query: { ...router.query, page: pageNumber } }}
               className={`w-10 h-10 rounded-full inline-flex items-center justify-center text-sm ${
-                pageNumber === currentPage
+                pageNumber !== currentPage
                   ? 'bg-indigo-600 font-semibold text-white'
                   : 'ring-1 ring-inset ring-gray-300'
killedBy: Paginationのテスト Paginationの現在のページのボタンがアクティブ表記されているか
statusReason: expect(element).toHaveClass("bg-indigo-600")

Expected the element to have class:
  bg-indigo-600
Received:
  w-10 h-10 rounded-full inline-flex items-center justify-center text-sm ring-1 ring-inset ring-gray-300
