[Survived] StringLiteral
src/Components/repositorySearchForm.tsx:4:12
 import Select from '@/Components/select'
 
 export const languageOprionts = [
-  { label: 'JavaScript', value: 'javascript' },
+  { label: "", value: 'javascript' },
   { label: 'TypeScript', value: 'typescript' },
   { label: 'Python', value: 'python' },

[Survived] ObjectLiteral
src/Components/repositorySearchForm.tsx:4:3
 import Select from '@/Components/select'
 
 export const languageOprionts = [
-  { label: 'JavaScript', value: 'javascript' },
+  {},
   { label: 'TypeScript', value: 'typescript' },
   { label: 'Python', value: 'python' },

[Survived] ObjectLiteral
src/Components/repositorySearchForm.tsx:5:3
 
 export const languageOprionts = [
   { label: 'JavaScript', value: 'javascript' },
-  { label: 'TypeScript', value: 'typescript' },
+  {},
   { label: 'Python', value: 'python' },
   { label: 'Go', value: 'go' },

[Survived] StringLiteral
src/Components/repositorySearchForm.tsx:5:12
 
 export const languageOprionts = [
   { label: 'JavaScript', value: 'javascript' },
-  { label: 'TypeScript', value: 'typescript' },
+  { label: "", value: 'typescript' },
   { label: 'Python', value: 'python' },
   { label: 'Go', value: 'go' },

[Survived] ObjectLiteral
src/Components/repositorySearchForm.tsx:6:3
 export const languageOprionts = [
   { label: 'JavaScript', value: 'javascript' },
   { label: 'TypeScript', value: 'typescript' },
-  { label: 'Python', value: 'python' },
+  {},
   { label: 'Go', value: 'go' },
   { label: 'Java', value: 'java' },

[Survived] StringLiteral
src/Components/repositorySearchForm.tsx:8:12
   { label: 'TypeScript', value: 'typescript' },
   { label: 'Python', value: 'python' },
   { label: 'Go', value: 'go' },
-  { label: 'Java', value: 'java' },
+  { label: "", value: 'java' },
   { label: 'Kotlin', value: 'kotlin' },
   { label: 'Rust', value: 'rust' },

[Survived] StringLiteral
src/Components/repositorySearchForm.tsx:9:12
   { label: 'Python', value: 'python' },
   { label: 'Go', value: 'go' },
   { label: 'Java', value: 'java' },
-  { label: 'Kotlin', value: 'kotlin' },
+  { label: "", value: 'kotlin' },
   { label: 'Rust', value: 'rust' },
   { label: 'Ruby', value: 'ruby' },

[Survived] ObjectLiteral
src/Components/repositorySearchForm.tsx:11:3
   { label: 'Java', value: 'java' },
   { label: 'Kotlin', value: 'kotlin' },
   { label: 'Rust', value: 'rust' },
-  { label: 'Ruby', value: 'ruby' },
+  {},
   { label: 'PHP', value: 'php' },
   { label: 'Perl', value: 'perl' },

[Survived] StringLiteral
src/Components/repositorySearchForm.tsx:13:12
   { label: 'Rust', value: 'rust' },
   { label: 'Ruby', value: 'ruby' },
   { label: 'PHP', value: 'php' },
-  { label: 'Perl', value: 'perl' },
+  { label: "", value: 'perl' },
   { label: 'Swift', value: 'swift' },
   { label: 'C', value: 'c' },

[Survived] ObjectLiteral
src/Components/repositorySearchForm.tsx:16:3
   { label: 'Perl', value: 'perl' },
   { label: 'Swift', value: 'swift' },
   { label: 'C', value: 'c' },
-  { label: 'C#', value: 'c#' },
+  {},
   { label: 'C++', value: 'c++' },
   { label: 'Vue', value: 'Vue' },

[Survived] StringLiteral
src/Components/repositorySearchForm.tsx:16:12
   { label: 'Perl', value: 'perl' },
   { label: 'Swift', value: 'swift' },
   { label: 'C', value: 'c' },
-  { label: 'C#', value: 'c#' },
+  { label: "", value: 'c#' },
   { label: 'C++', value: 'c++' },
   { label: 'Vue', value: 'Vue' },

[Survived] StringLiteral
src/Components/repositorySearchForm.tsx:17:26
   { label: 'Swift', value: 'swift' },
   { label: 'C', value: 'c' },
   { label: 'C#', value: 'c#' },
-  { label: 'C++', value: 'c++' },
+  { label: 'C++', value: "" },
   { label: 'Vue', value: 'Vue' },
 ]

[Survived] StringLiteral
src/Components/repositorySearchForm.tsx:27:28
 }
 
 export const sortOptions: SortOption[] = [
-  { label: 'Stars', value: 'stars' },
+  { label: 'Stars', value: "" },
   { label: 'Forks', value: 'forks' },
 ]

[Survived] StringLiteral
src/Components/repositorySearchForm.tsx:28:28
 
 export const sortOptions: SortOption[] = [
   { label: 'Stars', value: 'stars' },
-  { label: 'Forks', value: 'forks' },
+  { label: 'Forks', value: "" },
 ]
 

[Survived] StringLiteral
src/Components/repositorySearchForm.tsx:28:12
 
 export const sortOptions: SortOption[] = [
   { label: 'Stars', value: 'stars' },
-  { label: 'Forks', value: 'forks' },
+  { label: "", value: 'forks' },
 ]
 

[Killed] BlockStatement
src/Components/repositorySearchForm.tsx:36:73
   sort: string
 }
 
-export default function RepositorySearchForm({ language, sort }: Props) {
-  return (
-    <form method='get' action='/'>
-      <div className='mt-4 flex flex-row'>
-        <div className='mr-4'>
-          <Select name='language' defaultVal={language} options={languageOprionts} />
-        </div>
-        <div className='mr-4'>
-          <Select name='sort' defaultVal={sort} options={sortOptions} />
-        </div>
-        <div>
-          <button
-            type='submit'
-            id='searchbutton'
-            className='border border-black text-black font-bold py-2 px-4 rounded-full'
-          >
-            <i className='ri-search-line'></i>
-          </button>
-        </div>
-      </div>
-    </form>
-  )
-}
+export default function RepositorySearchForm({ language, sort }: Props) {}
 
killedBy: RepositSearchFormのテスト RepositSearchFormに言語選択コンボボックスが設定されているかどうか
statusReason: Unable to find an accessible element with the role "combobox"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>
